-- MySQL dump 10.13  Distrib 5.7.32, for Win64 (x86_64)
--
-- Host: localhost    Database: travel_time
-- ------------------------------------------------------
-- Server version	5.7.32-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `metro_line`
--

DROP TABLE IF EXISTS `metro_line`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_line` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `line_id` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `line_id_UNIQUE` (`line_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_line`
--

LOCK TABLES `metro_line` WRITE;
/*!40000 ALTER TABLE `metro_line` DISABLE KEYS */;
INSERT INTO `metro_line` VALUES (1,'BL'),(2,'BR'),(3,'G'),(4,'O'),(5,'R'),(6,'Y');
/*!40000 ALTER TABLE `metro_line` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_line_station`
--

DROP TABLE IF EXISTS `metro_line_station`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_line_station` (
  `id` int(10) unsigned NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `sequence` int(10) NOT NULL,
  `stop_time` time NOT NULL,
  PRIMARY KEY (`id`),
  KEY `line_id` (`line_id`),
  KEY `station_id` (`station_id`),
  CONSTRAINT `metro_line_station_ibfk_1` FOREIGN KEY (`line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_line_station_ibfk_2` FOREIGN KEY (`station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_line_station`
--

LOCK TABLES `metro_line_station` WRITE;
/*!40000 ALTER TABLE `metro_line_station` DISABLE KEYS */;
/*!40000 ALTER TABLE `metro_line_station` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_route`
--

DROP TABLE IF EXISTS `metro_route`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_route` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `route_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `start_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `end_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `is_holiday` tinyint(4) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `interval_min` int(10) unsigned NOT NULL,
  `interval_max` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `line_id` (`line_id`),
  KEY `start_station_id` (`start_station_id`),
  KEY `end_station_id` (`end_station_id`),
  CONSTRAINT `metro_route_ibfk_1` FOREIGN KEY (`line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_route_ibfk_2` FOREIGN KEY (`start_station_id`) REFERENCES `metro_station` (`station_id`),
  CONSTRAINT `metro_route_ibfk_3` FOREIGN KEY (`end_station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB AUTO_INCREMENT=97 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_route`
--

LOCK TABLES `metro_route` WRITE;
/*!40000 ALTER TABLE `metro_route` DISABLE KEYS */;
INSERT INTO `metro_route` VALUES (1,'BL-1','BL','BL01','BL23',1,'09:00:00','23:00:00',8,9),(2,'BL-1','BL','BL01','BL23',1,'06:00:00','09:00:00',8,8),(3,'BL-1','BL','BL01','BL23',1,'23:00:00','00:00:00',8,12),(4,'BL-1','BL','BL01','BL23',0,'07:00:00','09:00:00',6,6),(5,'BL-1','BL','BL01','BL23',0,'09:00:00','17:00:00',8,10),(6,'BL-1','BL','BL01','BL23',0,'23:00:00','00:00:00',8,12),(7,'BL-1','BL','BL01','BL23',0,'06:00:00','07:00:00',8,10),(8,'BL-1','BL','BL01','BL23',0,'17:00:00','19:30:00',6,6),(9,'BL-1','BL','BL01','BL23',0,'19:30:00','23:00:00',8,10),(10,'BL-2','BL','BL05','BL23',0,'19:30:00','23:00:00',8,10),(11,'BL-2','BL','BL05','BL23',0,'17:00:00','19:30:00',6,6),(12,'BL-2','BL','BL05','BL23',0,'23:00:00','00:00:00',8,12),(13,'BL-2','BL','BL05','BL23',0,'09:00:00','17:00:00',8,10),(14,'BL-2','BL','BL05','BL23',0,'07:00:00','09:00:00',6,6),(15,'BL-2','BL','BL05','BL23',0,'06:00:00','07:00:00',8,10),(16,'BL-2','BL','BL05','BL23',1,'23:00:00','00:00:00',8,12),(17,'BL-2','BL','BL05','BL23',1,'06:00:00','09:00:00',8,8),(18,'BL-2','BL','BL05','BL23',1,'09:00:00','23:00:00',8,9),(19,'BR-1','BR','BR01','BR24',1,'23:00:00','00:00:00',12,12),(20,'BR-1','BR','BR01','BR24',1,'06:00:00','23:00:00',4,10),(21,'BR-1','BR','BR01','BR24',0,'07:00:00','09:00:00',2,4),(22,'BR-1','BR','BR01','BR24',0,'23:00:00','00:00:00',12,12),(23,'BR-1','BR','BR01','BR24',0,'19:30:00','23:00:00',4,10),(24,'BR-1','BR','BR01','BR24',0,'17:00:00','19:30:00',2,4),(25,'BR-1','BR','BR01','BR24',0,'06:00:00','07:00:00',4,10),(26,'BR-1','BR','BR01','BR24',0,'09:00:00','17:00:00',4,10),(27,'G-1','G','G01','G19',1,'23:00:00','00:00:00',12,12),(28,'G-1','G','G01','G19',1,'06:00:00','09:00:00',8,10),(29,'G-1','G','G01','G19',1,'09:00:00','23:00:00',6,8),(30,'G-1','G','G01','G19',0,'09:00:00','17:00:00',6,8),(31,'G-1','G','G01','G19',0,'06:00:00','07:00:00',6,8),(32,'G-1','G','G01','G19',0,'17:00:00','19:30:00',4,6),(33,'G-1','G','G01','G19',0,'07:00:00','09:00:00',4,6),(34,'G-1','G','G01','G19',0,'23:00:00','00:00:00',12,12),(35,'G-1','G','G01','G19',0,'19:30:00','23:00:00',6,8),(36,'G-2','G','G08','G19',1,'09:00:00','23:00:00',6,8),(37,'G-2','G','G08','G19',1,'23:00:00','00:00:00',12,12),(38,'G-2','G','G08','G19',1,'06:00:00','09:00:00',8,10),(39,'G-2','G','G08','G19',0,'06:00:00','07:00:00',6,8),(40,'G-2','G','G08','G19',0,'07:00:00','09:00:00',4,6),(41,'G-2','G','G08','G19',0,'19:30:00','23:00:00',6,8),(42,'G-2','G','G08','G19',0,'23:00:00','00:00:00',12,12),(43,'G-2','G','G08','G19',0,'09:00:00','17:00:00',6,8),(44,'G-2','G','G08','G19',0,'17:00:00','19:30:00',4,6),(45,'G-3','G','G03','G03A',0,'06:00:00','00:00:00',12,20),(46,'G-3','G','G03','G03A',1,'06:00:00','00:00:00',12,20),(47,'O-1','O','O01','O21',0,'17:00:00','19:30:00',6,6),(48,'O-1','O','O01','O21',0,'09:00:00','17:00:00',8,10),(49,'O-1','O','O01','O21',0,'19:30:00','23:00:00',8,10),(50,'O-1','O','O01','O21',0,'06:00:00','07:00:00',8,10),(51,'O-1','O','O01','O21',0,'23:00:00','00:00:00',12,12),(52,'O-1','O','O01','O21',0,'07:00:00','09:00:00',6,6),(53,'O-1','O','O01','O21',1,'06:00:00','23:00:00',9,10),(54,'O-1','O','O01','O21',1,'23:00:00','00:00:00',12,12),(55,'O-2','O','O01','O54',0,'19:30:00','23:00:00',8,10),(56,'O-2','O','O01','O54',0,'06:00:00','07:00:00',8,10),(57,'O-2','O','O01','O54',0,'23:00:00','00:00:00',12,12),(58,'O-2','O','O01','O54',0,'09:00:00','17:00:00',8,10),(59,'O-2','O','O01','O54',0,'17:00:00','19:30:00',6,6),(60,'O-2','O','O01','O54',0,'07:00:00','09:00:00',6,6),(61,'O-2','O','O01','O54',1,'06:00:00','23:00:00',9,10),(62,'O-2','O','O01','O54',1,'23:00:00','00:00:00',12,12),(63,'R-1','R','R02','R28',1,'09:00:00','23:00:00',8,10),(64,'R-1','R','R02','R28',1,'23:00:00','00:00:00',12,12),(65,'R-1','R','R02','R28',1,'06:00:00','09:00:00',8,10),(66,'R-1','R','R02','R28',0,'19:30:00','23:00:00',8,10),(67,'R-1','R','R02','R28',0,'17:00:00','19:30:00',6,6),(68,'R-1','R','R02','R28',0,'09:00:00','17:00:00',8,10),(69,'R-1','R','R02','R28',0,'23:00:00','00:00:00',12,12),(70,'R-1','R','R02','R28',0,'06:00:00','07:00:00',8,10),(71,'R-1','R','R02','R28',0,'07:00:00','09:00:00',6,6),(72,'R-2','R','R05','R22',0,'07:00:00','09:00:00',6,6),(73,'R-2','R','R05','R22',0,'09:00:00','17:00:00',8,10),(74,'R-2','R','R05','R22',0,'17:00:00','19:30:00',6,6),(75,'R-2','R','R05','R22',0,'06:00:00','07:00:00',8,10),(76,'R-2','R','R05','R22',0,'19:30:00','23:00:00',8,10),(77,'R-2','R','R05','R22',0,'23:00:00','00:00:00',12,12),(78,'R-2','R','R05','R22',1,'06:00:00','09:00:00',8,10),(79,'R-2','R','R05','R22',1,'23:00:00','00:00:00',12,12),(80,'R-2','R','R05','R22',1,'09:00:00','23:00:00',8,10),(81,'R-3','R','R22','R22A',1,'06:00:00','23:00:00',10,12),(82,'R-3','R','R22','R22A',1,'23:00:00','00:00:00',12,15),(83,'R-3','R','R22','R22A',0,'17:00:00','19:30:00',7,8),(84,'R-3','R','R22','R22A',0,'23:00:00','00:00:00',12,15),(85,'R-3','R','R22','R22A',0,'09:00:00','17:00:00',10,10),(86,'R-3','R','R22','R22A',0,'06:30:00','09:00:00',7,8),(87,'R-3','R','R22','R22A',0,'06:00:00','06:30:00',12,15),(88,'R-3','R','R22','R22A',0,'19:30:00','23:00:00',8,10),(89,'Y-1','Y','Y07','Y20',1,'23:00:00','00:00:00',12,15),(90,'Y-1','Y','Y07','Y20',1,'06:00:00','23:00:00',5,10),(91,'Y-1','Y','Y07','Y20',0,'19:30:00','23:00:00',5,10),(92,'Y-1','Y','Y07','Y20',0,'23:00:00','00:00:00',12,15),(93,'Y-1','Y','Y07','Y20',0,'06:00:00','07:00:00',5,10),(94,'Y-1','Y','Y07','Y20',0,'17:00:00','19:30:00',4,7),(95,'Y-1','Y','Y07','Y20',0,'09:00:00','17:00:00',5,10),(96,'Y-1','Y','Y07','Y20',0,'07:00:00','09:00:00',4,7);
/*!40000 ALTER TABLE `metro_route` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_station`
--

DROP TABLE IF EXISTS `metro_station`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_station` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `name_cht` varchar(255) COLLATE utf8_bin NOT NULL,
  `name_eng` varchar(255) COLLATE utf8_bin NOT NULL,
  `lat` decimal(10,8) NOT NULL,
  `lon` decimal(11,8) NOT NULL,
  `address` varchar(255) COLLATE utf8_bin NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `sequence` int(10) unsigned NOT NULL,
  `previous_seq` int(10) unsigned DEFAULT NULL,
  `next_seq` int(10) unsigned DEFAULT NULL,
  `run_time_to_previous` int(10) unsigned DEFAULT NULL,
  `run_time_to_next` int(10) unsigned DEFAULT NULL,
  `stop_time` int(10) unsigned DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `station_id_UNIQUE` (`station_id`)
) ENGINE=InnoDB AUTO_INCREMENT=136 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_station`
--

LOCK TABLES `metro_station` WRITE;
/*!40000 ALTER TABLE `metro_station` DISABLE KEYS */;
INSERT INTO `metro_station` VALUES (1,'BL01','頂埔','Dingpu',24.96012000,121.42050000,'236040新北市土城區中央路4段51之6號B3','BL',1,NULL,2,NULL,180,NULL),(2,'BL02','永寧','Yongning',24.96682000,121.43613000,'236036新北市土城區中央路3段105號B1','BL',2,1,3,180,95,28),(3,'BL03','土城','Tucheng',24.97313000,121.44432000,'236017新北市土城區金城路1段105號B1','BL',3,2,4,95,106,26),(4,'BL04','海山','Haishan',24.98530500,121.44873000,'236023新北市土城區海山路39號B2','BL',4,3,5,106,142,26),(5,'BL05','亞東醫院','Far Eastern Hospital',24.99828000,121.45246500,'220056新北市板橋區南雅南路2段17號B1','BL',5,4,6,142,102,26),(6,'BL06','府中','Fuzhong',25.00846500,121.45927600,'220052新北市板橋區縣民大道1段193號B1','BL',6,5,7,102,67,28),(7,'BL07','板橋','Banqiao',25.01382500,121.46230500,'220073新北市板橋區站前路5號B1','BL',7,6,8,67,107,28),(8,'BL08','新埔','Xinpu',25.02327000,121.46805500,'220030新北市板橋區民生路3段2號B1','BL',8,7,9,107,77,28),(9,'BL09','江子翠','Jiangzicui',25.03026500,121.47257000,'220016新北市板橋區文化路2段296號B1','BL',9,8,10,77,192,28),(10,'BL10','龍山寺','Longshan Temple',25.03528000,121.50032500,'108015臺北市萬華區西園路1段153號','BL',10,9,11,192,110,29),(11,'BL11','西門','Ximen',25.04202500,121.50817500,'100005臺北市中正區寶慶路32之1號B1','BL',11,10,12,110,120,35),(12,'BL12','台北車站','Taipei Main Station',25.04631000,121.51741500,'100009臺北市中正區忠孝西路1段49號','BL',12,11,13,120,66,42),(13,'BL13','善導寺','Shandao Temple',25.04468000,121.52388500,'100024臺北市中正區忠孝東路1段58號B1','BL',13,12,14,66,81,25),(14,'BL14','忠孝新生','Zhongxiao Xinsheng',25.04249800,121.53321000,'106083臺北市大安區新生南路1段67號','BL',14,13,15,81,90,40),(15,'BL15','忠孝復興','Zhongxiao Fuxing',25.04174900,121.54502600,'106071臺北市大安區忠孝東路4段47號','BL',15,14,16,90,65,40),(16,'BL16','忠孝敦化','Xhongxiao Dunhua',25.04150500,121.55045000,'106057臺北市大安區忠孝東路4段182號','BL',16,15,17,65,71,28),(17,'BL17','國父紀念館','Sun Yat-Sen Memorial Hall',25.04137000,121.55781500,'110054臺北市信義區忠孝東路4段400號','BL',17,16,18,71,77,28),(18,'BL18','市政府','Taipei City Hall',25.04113500,121.56568500,'110060臺北市信義區忠孝東路5段2號','BL',18,17,19,77,87,28),(19,'BL19','永春','Yongchun',25.04085500,121.57620000,'110037臺北市信義區忠孝東路5段455號','BL',19,18,20,87,76,25),(20,'BL20','後山埤','Houshanpi',25.04471500,121.58227000,'115025臺北市南港區忠孝東路6段2號','BL',20,19,21,76,107,29),(21,'BL21','昆陽','Kunyang',25.05045900,121.59322800,'115007臺北市南港區忠孝東路6段451號','BL',21,20,22,107,109,25),(22,'BL22','南港','Nangang',25.05203500,121.60697000,'115011臺北市南港區忠孝東路7段380號','BL',22,21,23,109,112,24),(23,'BL23','南港展覽館','Taipei Nangang Exhibition Center',25.05491900,121.61686100,'板南線：115021臺北市南港區研究院路1段1號','BL',23,22,NULL,112,NULL,0),(24,'BR01','動物園','Taipei Zoo',24.99820500,121.57950100,'116016臺北市文山區新光路2段32號','BR',1,NULL,2,NULL,67,NULL),(25,'BR02','木柵','Muzha',24.99824000,121.57312700,'116027臺北市文山區木柵路4段135號','BR',2,1,3,67,47,25),(26,'BR03','萬芳社區','Wanfang Community',24.99857000,121.56808800,'116027臺北市文山區萬芳路60號','BR',3,2,4,47,99,25),(27,'BR04','萬芳醫院','Wanfang Hospital',24.99932000,121.55809200,'116081臺北市文山區興隆路3段113號','BR',4,3,5,99,106,25),(28,'BR05','辛亥','Xinhai',25.00545500,121.55704600,'116081臺北市文山區辛亥路4段128號','BR',5,4,6,106,124,25),(29,'BR06','麟光','Linguang',25.01849500,121.55883400,'106043臺北市大安區和平東路3段410號','BR',6,5,7,124,72,25),(30,'BR07','六張犁','Liuzhangli',25.02381000,121.55302000,'106039臺北市大安區和平東路3段168號','BR',7,6,8,72,122,25),(31,'BR08','科技大樓','Technology Building',25.02612000,121.54346200,'106101臺北市大安區復興南路2段235號','BR',8,7,9,122,69,25),(32,'BR09','大安','Daan',25.03331100,121.54237000,'106097臺北市大安區信義路4段2號','BR',9,8,10,69,67,30),(33,'BR10','忠孝復興','Zhongxiao Fuxing',25.04174900,121.54502600,'106084臺北市大安區忠孝東路3段302號','BR',10,9,11,67,86,45),(34,'BR11','南京復興','Nanjing Fuxing',25.05204400,121.54430300,'105020臺北市松山區南京東路3段253號','BR',11,10,12,86,66,30),(35,'BR12','中山國中','Zhongshan Junior High School',25.06085000,121.54421500,'104079臺北市中山區復興北路376號','BR',12,11,13,66,142,25),(36,'BR13','松山機場','Songshan Airport',25.06290800,121.55201000,'105008臺北市松山區敦化北路338號','BR',13,12,14,142,172,25),(37,'BR14','大直','Dazhi',25.07943000,121.54679000,'104044臺北市中山區北安路534之1號','BR',14,13,15,172,103,25),(38,'BR15','劍南路','Jiannan Rd.',25.08483000,121.55558200,'104051臺北市中山區北安路798號','BR',15,14,16,103,110,25),(39,'BR16','西湖','Xihu',25.08216000,121.56722700,'114066臺北市內湖區內湖路1段256號','BR',16,15,17,110,65,25),(40,'BR17','港墘','Gangqian',25.08007000,121.57516000,'114004臺北市內湖區內湖路1段663號','BR',17,16,18,65,72,25),(41,'BR18','文德','Wende',25.07845500,121.58499900,'114053臺北市內湖區文德路214號','BR',18,17,19,72,78,25),(42,'BR19','內湖','Neihu',25.08367500,121.59436300,'114049臺北市內湖區成功路4段186號','BR',19,18,20,78,71,25),(43,'BR20','大湖公園','Dahu Park',25.08380500,121.60221400,'114041臺北市內湖區成功路5段11號','BR',20,19,21,71,121,25),(44,'BR21','葫洲','Huzhou',25.07271000,121.60714600,'114046臺北市內湖區康寧路3段16號','BR',21,20,22,121,78,25),(45,'BR22','東湖','Donghu',25.06745500,121.61153500,'114056臺北市內湖區康寧路3段235號','BR',22,21,23,78,85,25),(46,'BR23','南港軟體園區','Nangang Software Park',25.05992000,121.61500000,'115018臺北市南港區經貿二路183號','BR',23,22,24,85,78,25),(47,'BR24','南港展覽館','Taipei Nangang Exhibition Center',25.05491900,121.61686100,'文湖線：115018臺北市南港區南港路1段32號','BR',24,23,NULL,78,NULL,0),(48,'G01','新店','Xindian',24.95761000,121.53746000,'231039新北市新店區北宜路1段2號','G',1,NULL,2,NULL,111,NULL),(49,'G02','新店區公所','Xindian District Office',24.96744000,121.54130000,'231634新北市新店區北新路1段295號','G',2,1,3,111,81,25),(50,'G03','七張','Qizhang',24.97545000,121.54298500,'231007新北市新店區北新路2段150號','G',3,2,20,81,203,0),(51,'G03A','小碧潭','Xiaobitan',24.97188000,121.53058000,'231222新北市新店區中央路151號4樓','G',20,3,NULL,203,NULL,NULL),(52,'G04','大坪林','Dapinglin',24.98272000,121.54134000,'23143新北市新店區北新路3段190號','G',4,3,5,78,92,27),(53,'G05','景美','Jingmei',24.99282400,121.54069700,'116056臺北市文山區羅斯福路6段216號','G',5,4,6,92,89,27),(54,'G06','萬隆','Wanlong',25.00197800,121.53900800,'116060臺北市文山區羅斯福路5段214號','G',6,5,7,89,122,27),(55,'G07','公館','Gongguan',25.01478100,121.53435800,'100046臺北市中正區羅斯福路4段64之1號B1','G',7,6,8,122,79,29),(56,'G08','台電大樓','Taipower Building',25.02073300,121.52814300,'100043臺北市中正區羅斯福路3段126之5號B1','G',8,7,9,79,85,30),(57,'G09','古亭','Guting',25.02637300,121.52286800,'100032臺北市中正區羅斯福路2段164之1號B1','G',9,8,10,85,87,33),(58,'G10','中正紀念堂','Chiang Kai-Shek Memorial Hall',25.03276700,121.51827300,'100207臺北市中正區羅斯福路1段8之1號B1?','G',10,9,11,87,76,38),(59,'G11','小南門','Xiaonanmen',25.03558500,121.51088000,'100057臺北市中正區愛國西路22號B1','G',11,10,12,76,83,27),(60,'G12','西門','Ximen',25.04202500,121.50817500,'100005臺北市中正區寶慶路32之1號B1','G',12,11,13,83,86,34),(61,'G13','北門','Beimen',25.04955400,121.51018400,'103005臺北市大同區塔城街10號','G',13,12,14,86,116,28),(62,'G14','中山','Zhongshan',25.05262100,121.52036400,'103022臺北市大同區南京西路55號','G',14,13,15,116,106,35),(63,'G15','松江南京','Songjiang Nanjing',25.05269300,121.53285000,'104092臺北市中山區松江路126號B1','G',15,14,16,106,92,35),(64,'G16','南京復興','Nanjing Fuxing',25.05204400,121.54430300,'105020臺北市松山區南京東路3段253號','G',16,15,17,92,84,33),(65,'G17','台北小巨蛋','Taipei Arena',25.05152000,121.55254900,'105037臺北市松山區南京東路4段10之1號','G',17,16,18,84,102,27),(66,'G18','南京三民','Nanjing Sanmin',25.05158800,121.56471000,'105062臺北市松山區南京東路5段237號','G',18,17,19,102,138,27),(67,'G19','松山','Songshan',25.05011800,121.57770600,'105057臺北市松山區八德路4段742號','G',19,18,NULL,138,NULL,0),(68,'O01','南勢角','Nanshijiao',24.99006500,121.50923700,'235050新北市中和區捷運路6號','O',1,NULL,2,NULL,97,NULL),(69,'O02','景安','Jingan',24.99392000,121.50511400,'23582新北市中和區景平路486號','O',2,1,3,97,90,28),(70,'O03','永安市場','Yongan Market',25.00289500,121.51122500,'235066新北市中和區中和路388號','O',3,2,4,90,103,29),(71,'O04','頂溪','Dingxi',25.01385800,121.51546200,'234016新北市永和區永和路2段168號B1','O',4,3,5,103,187,29),(72,'O05','古亭','Guting',25.02637300,121.52286800,'100032臺北市中正區羅斯福路2段164之1號B1','O',5,4,6,187,208,33),(73,'O06','東門','Dongmen',25.03389400,121.52876600,'10650臺北市大安區信義路2段166號B1','O',6,5,7,208,136,33),(74,'O07','忠孝新生','Zhongxiao Xinsheng',25.04249800,121.53321000,'106083臺北市大安區新生南路1段67號','O',7,6,8,136,102,38),(75,'O08','松江南京','Songjiang Nanjing',25.05269300,121.53285000,'104092臺北市中山區松江路126號B1','O',8,7,9,102,78,30),(76,'O09','行天宮','Xingtian Temple',25.05924000,121.53315000,'104023臺北市中山區松江路316號B1','O',9,8,10,78,96,30),(77,'O10','中山國小','Zhongshan Elementary School',25.06266500,121.52660900,'104028臺北市中山區民權東路1段71號B1','O',10,9,11,96,72,30),(78,'O11','民權西路','Minquan W. Rd.',25.06235000,121.51958500,'103045臺北市大同區民權西路72號','O',11,10,12,72,72,33),(79,'O12','大橋頭','Daqiaotou',25.06322000,121.51300300,'103041臺北市大同區民權西路223號B1','O',12,11,13,72,151,26),(80,'O13','台北橋','Taipei Bridge',25.06307500,121.50057500,'241454新北市三重區重新路1段108號B1','O',13,12,14,127,97,25),(81,'O14','菜寮','Cailiao',25.05945100,121.49142100,'241007新北市三重區重新路3段150號B1','O',14,13,15,97,84,25),(82,'O15','三重','Sanchong',25.05571000,121.48422000,'241012新北市三重區捷運路36號B1','O',15,14,16,84,142,25),(83,'O16','先嗇宮','Xianse Temple',25.04632000,121.47165000,'241017新北市三重區重新路5段515號B1','O',16,15,17,142,108,25),(84,'O17','頭前庄','Touqianzhuang',25.03986200,121.46047900,'24251新北市新莊區思源路18號B1','O',17,16,18,108,94,25),(85,'O18','新莊','Xinzhuang',25.03608000,121.45218000,'242008新北市新莊區中正路138號B1','O',18,17,19,94,137,25),(86,'O19','輔大','Fu Jen University',25.03279000,121.43573500,'242062新北市新莊區中正路510之1號B1','O',19,18,20,137,113,25),(87,'O20','丹鳳','Danfeng',25.02907300,121.42242200,'242048新北市新莊區中正路624之1號B1','O',20,19,21,113,168,25),(88,'O21','迴龍','Huilong',25.02210700,121.41175700,'242052新北市新莊區中正路758號B1','O',21,20,NULL,168,NULL,0),(89,'O50','三重國小','Sanchong Elementary School',25.07027500,121.49701000,'241054新北市三重區三和路3段5號B1','O',13,12,14,151,107,25),(90,'O51','三和國中','Sanhe Junior High School',25.07646000,121.48679500,'241080新北市三重區三和路4段107號B1','O',14,13,15,107,82,25),(91,'O52','徐匯中學','St.lgnatius High School',25.08048500,121.47994500,'247019新北市蘆洲區中山一路3號B1','O',15,14,16,82,92,25),(92,'O53','三民高中','Sanmin Senior High School',25.08542500,121.47336500,'247010新北市蘆洲區三民路105號B1','O',16,15,17,92,111,25),(93,'O54','蘆洲','Luzhou',25.09152000,121.46471000,'247011新北市蘆洲區三民路386號B1','O',17,16,NULL,111,NULL,0),(94,'R02','象山','Xiangshan',25.03239500,121.57011600,'110022臺北市信義區信義路5段152號B1','R',1,NULL,2,NULL,93,NULL),(95,'R03','台北101/世貿','Taipei 101/World Trade Center',25.03286500,121.56366700,'110013臺北市信義區信義路5段20號B1','R',2,1,3,93,94,29),(96,'R04','信義安和','Xinyi Anhe',25.03301500,121.55232600,'106049臺北市大安區信義路4段212之1號B1','R',3,2,4,94,90,26),(97,'R05','大安','Daan',25.03331100,121.54237000,'106028臺北市大安區信義路3段180號B1','R',4,3,5,90,74,37),(98,'R06','大安森林公園','Daan Park',25.03322500,121.53615100,'106008臺北市大安區信義路3段100號B1','R',5,4,6,74,75,25),(99,'R07','東門','Dongmen',25.03389400,121.52876600,'106007臺北市大安區信義路2段166號B1','R',6,5,7,75,175,31),(100,'R08','中正紀念堂','Chiang Kai-Shek Memorial Hall',25.03276700,121.51827300,'100207臺北市中正區羅斯福路1段8之1號B1?','R',7,6,8,175,95,30),(101,'R09','台大醫院','NTU Hospital',25.04139900,121.51602000,'100006臺北市中正區公園路52號B1','R',8,7,9,95,67,26),(102,'R10','台北車站','Taipei Main Station',25.04631000,121.51741500,'100009臺北市中正區忠孝西路1段49號','R',9,8,10,67,68,35),(103,'R11','中山','Zhongshan',25.05262100,121.52036400,'103014臺北市大同區南京西路16號','R',10,9,11,68,62,28),(104,'R12','雙連','Shuanglian',25.05757500,121.52068500,'103018臺北市大同區民生西路47號','R',11,10,12,62,60,28),(105,'R13','民權西路','Minquan W. Rd.',25.06235000,121.51958500,'103045臺北市大同區民權西路72號','R',12,11,13,60,88,34),(106,'R14','圓山','Yuanshan',25.07140900,121.52007400,'103032臺北市大同區酒泉街9之1號','R',13,12,14,88,112,26),(107,'R15','劍潭','Jiantan',25.08420100,121.52495500,'111011臺北市士林區中山北路5段65號','R',14,13,15,112,95,26),(108,'R16','士林','Shilin',25.09349200,121.52623000,'111012臺北市士林區福德路1號','R',15,14,16,95,94,26),(109,'R17','芝山','Zhishan',25.10271800,121.52254600,'111031臺北市士林區福國路70號','R',16,15,17,94,79,26),(110,'R18','明德','Mingde',25.10981500,121.51878500,'112038臺北市北投區明德路95號','R',17,16,18,79,63,26),(111,'R19','石牌','Shipai',25.11445500,121.51557200,'112052臺北市北投區石牌路1段200號','R',18,17,19,63,103,26),(112,'R20','唭哩岸','Qilian',25.12085200,121.50623400,'112025臺北市北投區東華街2段301號','R',19,18,20,103,75,24),(113,'R21','奇岩','Qiyan',25.12547000,121.50114000,'112057臺北市北投區三合街2段489號','R',20,19,21,75,91,23),(114,'R22','北投','Beitou',25.13181900,121.49864800,'112006臺北市北投區光明路1號','R',21,20,28,91,157,0),(115,'R22A','新北投','Xinbeitou',25.13693100,121.50259500,'112028臺北市北投區大業路700號','R',28,21,NULL,157,NULL,NULL),(116,'R23','復興崗','Fuxinggang',25.13749700,121.48545600,'112054臺北市北投區中央北路3段53巷10號','R',22,21,23,135,112,25),(117,'R24','忠義','Zhongyi',25.13092300,121.47329800,'112017臺北市北投區中央北路4段301號','R',23,22,24,112,80,25),(118,'R25','關渡','Guandu',25.12551000,121.46700000,'112021臺北市北投區大度路3段296巷51號','R',24,23,25,80,148,25),(119,'R26','竹圍','Zhuwei',25.13690000,121.45955000,'251033新北市淡水區民權路50號','R',25,24,26,148,138,25),(120,'R27','紅樹林','Hongshulin',25.15399000,121.45880000,'251033新北市淡水區中正東路2段68號','R',26,25,27,138,175,25),(121,'R28','淡水','Tamsui',25.16774500,121.44580500,'251018新北市淡水區中正路1號','R',27,26,NULL,175,NULL,0),(122,'Y07','大坪林','Dapinglin',24.98272000,121.54134000,'23143新北市新店區北新路3段190號','Y',1,NULL,2,NULL,145,NULL),(123,'Y08','十四張','Shisizhang',24.98433300,121.52769800,'23141新北市新店區民權路282號','Y',2,1,3,145,111,23),(124,'Y09','秀朗橋','Xiulang Bridge',24.99054900,121.52505100,'23582新北市中和區景平路2號','Y',3,2,4,111,79,23),(125,'Y10','景平','Jingping',24.99196800,121.51655300,'23578新北市中和區景平路121號','Y',4,3,5,79,84,25),(126,'Y11','景安','Jingan',24.99392000,121.50511400,'23582新北市中和區景平路486號','Y',5,4,6,84,194,35),(127,'Y12','中和','Zhonghe',25.00198100,121.49605200,'23558新北市中和區中山路二段271號','Y',6,5,7,194,104,25),(128,'Y13','橋和','Qiaohe',25.00441300,121.49046100,'23557新北市中和區板南路430號','Y',7,6,8,104,72,25),(129,'Y14','中原','Zhongyuan',25.00841000,121.48415900,'23556新北市中和區板南路510號','Y',8,7,9,72,111,25),(130,'Y15','板新','Banxin',25.01449100,121.47221200,'22066新北市板橋區板新路109號','Y',9,8,10,111,153,25),(131,'Y16','板橋','Banqiao',25.01515600,121.46482500,'22041新北市板橋區新站路66號','Y',10,9,11,153,191,40),(132,'Y17','新埔民生','Xinpu Minsheng',25.02612500,121.46683900,'22047新北市板橋區民生路3段70號','Y',11,10,12,191,143,25),(133,'Y18','頭前庄','Touqianzhuang',25.03986200,121.46047900,'24251新北市新莊區思源路18號B1','Y',12,11,13,143,95,35),(134,'Y19','幸福','Xingfu',25.05028200,121.46021600,'24250新北市新莊區思源路292號','Y',13,12,14,95,135,23),(135,'Y20','新北產業園區','New Taipei Industrial Park',25.06154800,121.45992600,'24886新北市新莊區五工路35號','Y',14,13,NULL,135,NULL,0);
/*!40000 ALTER TABLE `metro_station` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_travel_time`
--

DROP TABLE IF EXISTS `metro_travel_time`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_travel_time` (
  `id` int(10) unsigned NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `start_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `end_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `run_time` bigint(20) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `start_station_id` (`start_station_id`),
  KEY `end_station_id` (`end_station_id`),
  CONSTRAINT `metro_travel_time_ibfk_1` FOREIGN KEY (`start_station_id`) REFERENCES `metro_station` (`station_id`),
  CONSTRAINT `metro_travel_time_ibfk_2` FOREIGN KEY (`end_station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_travel_time`
--

LOCK TABLES `metro_travel_time` WRITE;
/*!40000 ALTER TABLE `metro_travel_time` DISABLE KEYS */;
/*!40000 ALTER TABLE `metro_travel_time` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-11-27 16:49:26
