-- MySQL dump 10.13  Distrib 5.7.32, for Win64 (x86_64)
--
-- Host: localhost    Database: travel_time
-- ------------------------------------------------------
-- Server version	5.7.32-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `metro_line`
--

DROP TABLE IF EXISTS `metro_line`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_line` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `line_id` varchar(45) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `line_id_UNIQUE` (`line_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_line`
--

LOCK TABLES `metro_line` WRITE;
/*!40000 ALTER TABLE `metro_line` DISABLE KEYS */;
INSERT INTO `metro_line` VALUES (1,'BL'),(2,'BR'),(3,'G'),(4,'O'),(5,'R'),(6,'Y');
/*!40000 ALTER TABLE `metro_line` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_line_station`
--

DROP TABLE IF EXISTS `metro_line_station`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_line_station` (
  `id` int(10) unsigned NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `sequence` int(10) NOT NULL,
  `stop_time` time NOT NULL,
  PRIMARY KEY (`id`),
  KEY `line_id` (`line_id`),
  KEY `station_id` (`station_id`),
  CONSTRAINT `metro_line_station_ibfk_1` FOREIGN KEY (`line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_line_station_ibfk_2` FOREIGN KEY (`station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_line_station`
--

LOCK TABLES `metro_line_station` WRITE;
/*!40000 ALTER TABLE `metro_line_station` DISABLE KEYS */;
/*!40000 ALTER TABLE `metro_line_station` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_route`
--

DROP TABLE IF EXISTS `metro_route`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_route` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `route_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `start_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `end_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `is_holiday` tinyint(4) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `interval_min` int(10) unsigned NOT NULL,
  `interval_max` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `line_id` (`line_id`),
  KEY `start_station_id` (`start_station_id`),
  KEY `end_station_id` (`end_station_id`),
  CONSTRAINT `metro_route_ibfk_1` FOREIGN KEY (`line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_route_ibfk_2` FOREIGN KEY (`start_station_id`) REFERENCES `metro_station` (`station_id`),
  CONSTRAINT `metro_route_ibfk_3` FOREIGN KEY (`end_station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_route`
--

LOCK TABLES `metro_route` WRITE;
/*!40000 ALTER TABLE `metro_route` DISABLE KEYS */;
/*!40000 ALTER TABLE `metro_route` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_station`
--

DROP TABLE IF EXISTS `metro_station`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_station` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `name_cht` varchar(255) COLLATE utf8_bin NOT NULL,
  `name_eng` varchar(255) COLLATE utf8_bin NOT NULL,
  `lat` decimal(10,8) NOT NULL,
  `lon` decimal(11,8) NOT NULL,
  `address` varchar(255) COLLATE utf8_bin NOT NULL,
  `line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `stop_time` int(10) unsigned DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `station_id_UNIQUE` (`station_id`)
) ENGINE=InnoDB AUTO_INCREMENT=136 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_station`
--

LOCK TABLES `metro_station` WRITE;
/*!40000 ALTER TABLE `metro_station` DISABLE KEYS */;
INSERT INTO `metro_station` VALUES (1,'BL01','頂埔','Dingpu',24.96012000,121.42050000,'236040新北市土城區中央路4段51之6號B3','BL',0),(2,'BL02','永寧','Yongning',24.96682000,121.43613000,'236036新北市土城區中央路3段105號B1','BL',28),(3,'BL03','土城','Tucheng',24.97313000,121.44432000,'236017新北市土城區金城路1段105號B1','BL',26),(4,'BL04','海山','Haishan',24.98530500,121.44873000,'236023新北市土城區海山路39號B2','BL',26),(5,'BL05','亞東醫院','Far Eastern Hospital',24.99828000,121.45246500,'220056新北市板橋區南雅南路2段17號B1','BL',26),(6,'BL06','府中','Fuzhong',25.00846500,121.45927600,'220052新北市板橋區縣民大道1段193號B1','BL',28),(7,'BL07','板橋','Banqiao',25.01382500,121.46230500,'220073新北市板橋區站前路5號B1','BL',28),(8,'BL08','新埔','Xinpu',25.02327000,121.46805500,'220030新北市板橋區民生路3段2號B1','BL',28),(9,'BL09','江子翠','Jiangzicui',25.03026500,121.47257000,'220016新北市板橋區文化路2段296號B1','BL',28),(10,'BL10','龍山寺','Longshan Temple',25.03528000,121.50032500,'108015臺北市萬華區西園路1段153號','BL',29),(11,'BL11','西門','Ximen',25.04202500,121.50817500,'100005臺北市中正區寶慶路32之1號B1','BL',35),(12,'BL12','台北車站','Taipei Main Station',25.04631000,121.51741500,'100009臺北市中正區忠孝西路1段49號','BL',42),(13,'BL13','善導寺','Shandao Temple',25.04468000,121.52388500,'100024臺北市中正區忠孝東路1段58號B1','BL',25),(14,'BL14','忠孝新生','Zhongxiao Xinsheng',25.04249800,121.53321000,'106083臺北市大安區新生南路1段67號','BL',40),(15,'BL15','忠孝復興','Zhongxiao Fuxing',25.04174900,121.54502600,'106071臺北市大安區忠孝東路4段47號','BL',40),(16,'BL16','忠孝敦化','Xhongxiao Dunhua',25.04150500,121.55045000,'106057臺北市大安區忠孝東路4段182號','BL',28),(17,'BL17','國父紀念館','Sun Yat-Sen Memorial Hall',25.04137000,121.55781500,'110054臺北市信義區忠孝東路4段400號','BL',28),(18,'BL18','市政府','Taipei City Hall',25.04113500,121.56568500,'110060臺北市信義區忠孝東路5段2號','BL',28),(19,'BL19','永春','Yongchun',25.04085500,121.57620000,'110037臺北市信義區忠孝東路5段455號','BL',25),(20,'BL20','後山埤','Houshanpi',25.04471500,121.58227000,'115025臺北市南港區忠孝東路6段2號','BL',29),(21,'BL21','昆陽','Kunyang',25.05045900,121.59322800,'115007臺北市南港區忠孝東路6段451號','BL',25),(22,'BL22','南港','Nangang',25.05203500,121.60697000,'115011臺北市南港區忠孝東路7段380號','BL',24),(23,'BL23','南港展覽館','Taipei Nangang Exhibition Center',25.05491900,121.61686100,'板南線：115021臺北市南港區研究院路1段1號','BL',0),(24,'BR01','動物園','Taipei Zoo',24.99820500,121.57950100,'116016臺北市文山區新光路2段32號','BR',0),(25,'BR02','木柵','Muzha',24.99824000,121.57312700,'116027臺北市文山區木柵路4段135號','BR',25),(26,'BR03','萬芳社區','Wanfang Community',24.99857000,121.56808800,'116027臺北市文山區萬芳路60號','BR',25),(27,'BR04','萬芳醫院','Wanfang Hospital',24.99932000,121.55809200,'116081臺北市文山區興隆路3段113號','BR',25),(28,'BR05','辛亥','Xinhai',25.00545500,121.55704600,'116081臺北市文山區辛亥路4段128號','BR',25),(29,'BR06','麟光','Linguang',25.01849500,121.55883400,'106043臺北市大安區和平東路3段410號','BR',25),(30,'BR07','六張犁','Liuzhangli',25.02381000,121.55302000,'106039臺北市大安區和平東路3段168號','BR',25),(31,'BR08','科技大樓','Technology Building',25.02612000,121.54346200,'106101臺北市大安區復興南路2段235號','BR',25),(32,'BR09','大安','Daan',25.03331100,121.54237000,'106097臺北市大安區信義路4段2號','BR',30),(33,'BR10','忠孝復興','Zhongxiao Fuxing',25.04174900,121.54502600,'106084臺北市大安區忠孝東路3段302號','BR',45),(34,'BR11','南京復興','Nanjing Fuxing',25.05204400,121.54430300,'105020臺北市松山區南京東路3段253號','BR',30),(35,'BR12','中山國中','Zhongshan Junior High School',25.06085000,121.54421500,'104079臺北市中山區復興北路376號','BR',25),(36,'BR13','松山機場','Songshan Airport',25.06290800,121.55201000,'105008臺北市松山區敦化北路338號','BR',25),(37,'BR14','大直','Dazhi',25.07943000,121.54679000,'104044臺北市中山區北安路534之1號','BR',25),(38,'BR15','劍南路','Jiannan Rd.',25.08483000,121.55558200,'104051臺北市中山區北安路798號','BR',25),(39,'BR16','西湖','Xihu',25.08216000,121.56722700,'114066臺北市內湖區內湖路1段256號','BR',25),(40,'BR17','港墘','Gangqian',25.08007000,121.57516000,'114004臺北市內湖區內湖路1段663號','BR',25),(41,'BR18','文德','Wende',25.07845500,121.58499900,'114053臺北市內湖區文德路214號','BR',25),(42,'BR19','內湖','Neihu',25.08367500,121.59436300,'114049臺北市內湖區成功路4段186號','BR',25),(43,'BR20','大湖公園','Dahu Park',25.08380500,121.60221400,'114041臺北市內湖區成功路5段11號','BR',25),(44,'BR21','葫洲','Huzhou',25.07271000,121.60714600,'114046臺北市內湖區康寧路3段16號','BR',25),(45,'BR22','東湖','Donghu',25.06745500,121.61153500,'114056臺北市內湖區康寧路3段235號','BR',25),(46,'BR23','南港軟體園區','Nangang Software Park',25.05992000,121.61500000,'115018臺北市南港區經貿二路183號','BR',25),(47,'BR24','南港展覽館','Taipei Nangang Exhibition Center',25.05491900,121.61686100,'文湖線：115018臺北市南港區南港路1段32號','BR',0),(48,'G01','新店','Xindian',24.95761000,121.53746000,'231039新北市新店區北宜路1段2號','G',0),(49,'G02','新店區公所','Xindian District Office',24.96744000,121.54130000,'231634新北市新店區北新路1段295號','G',25),(50,'G03','七張','Qizhang',24.97545000,121.54298500,'231007新北市新店區北新路2段150號','G',0),(51,'G03A','小碧潭','Xiaobitan',24.97188000,121.53058000,'231222新北市新店區中央路151號4樓','G',0),(52,'G04','大坪林','Dapinglin',24.98272000,121.54134000,'23143新北市新店區北新路3段190號','G',27),(53,'G05','景美','Jingmei',24.99282400,121.54069700,'116056臺北市文山區羅斯福路6段216號','G',27),(54,'G06','萬隆','Wanlong',25.00197800,121.53900800,'116060臺北市文山區羅斯福路5段214號','G',27),(55,'G07','公館','Gongguan',25.01478100,121.53435800,'100046臺北市中正區羅斯福路4段64之1號B1','G',29),(56,'G08','台電大樓','Taipower Building',25.02073300,121.52814300,'100043臺北市中正區羅斯福路3段126之5號B1','G',30),(57,'G09','古亭','Guting',25.02637300,121.52286800,'100032臺北市中正區羅斯福路2段164之1號B1','G',33),(58,'G10','中正紀念堂','Chiang Kai-Shek Memorial Hall',25.03276700,121.51827300,'100207臺北市中正區羅斯福路1段8之1號B1?','G',38),(59,'G11','小南門','Xiaonanmen',25.03558500,121.51088000,'100057臺北市中正區愛國西路22號B1','G',27),(60,'G12','西門','Ximen',25.04202500,121.50817500,'100005臺北市中正區寶慶路32之1號B1','G',34),(61,'G13','北門','Beimen',25.04955400,121.51018400,'103005臺北市大同區塔城街10號','G',28),(62,'G14','中山','Zhongshan',25.05262100,121.52036400,'103022臺北市大同區南京西路55號','G',35),(63,'G15','松江南京','Songjiang Nanjing',25.05269300,121.53285000,'104092臺北市中山區松江路126號B1','G',35),(64,'G16','南京復興','Nanjing Fuxing',25.05204400,121.54430300,'105020臺北市松山區南京東路3段253號','G',33),(65,'G17','台北小巨蛋','Taipei Arena',25.05152000,121.55254900,'105037臺北市松山區南京東路4段10之1號','G',27),(66,'G18','南京三民','Nanjing Sanmin',25.05158800,121.56471000,'105062臺北市松山區南京東路5段237號','G',27),(67,'G19','松山','Songshan',25.05011800,121.57770600,'105057臺北市松山區八德路4段742號','G',0),(68,'O01','南勢角','Nanshijiao',24.99006500,121.50923700,'235050新北市中和區捷運路6號','O',0),(69,'O02','景安','Jingan',24.99392000,121.50511400,'23582新北市中和區景平路486號','O',28),(70,'O03','永安市場','Yongan Market',25.00289500,121.51122500,'235066新北市中和區中和路388號','O',29),(71,'O04','頂溪','Dingxi',25.01385800,121.51546200,'234016新北市永和區永和路2段168號B1','O',29),(72,'O05','古亭','Guting',25.02637300,121.52286800,'100032臺北市中正區羅斯福路2段164之1號B1','O',33),(73,'O06','東門','Dongmen',25.03389400,121.52876600,'10650臺北市大安區信義路2段166號B1','O',33),(74,'O07','忠孝新生','Zhongxiao Xinsheng',25.04249800,121.53321000,'106083臺北市大安區新生南路1段67號','O',38),(75,'O08','松江南京','Songjiang Nanjing',25.05269300,121.53285000,'104092臺北市中山區松江路126號B1','O',30),(76,'O09','行天宮','Xingtian Temple',25.05924000,121.53315000,'104023臺北市中山區松江路316號B1','O',30),(77,'O10','中山國小','Zhongshan Elementary School',25.06266500,121.52660900,'104028臺北市中山區民權東路1段71號B1','O',30),(78,'O11','民權西路','Minquan W. Rd.',25.06235000,121.51958500,'103045臺北市大同區民權西路72號','O',33),(79,'O12','大橋頭','Daqiaotou',25.06322000,121.51300300,'103041臺北市大同區民權西路223號B1','O',26),(80,'O13','台北橋','Taipei Bridge',25.06307500,121.50057500,'241454新北市三重區重新路1段108號B1','O',25),(81,'O14','菜寮','Cailiao',25.05945100,121.49142100,'241007新北市三重區重新路3段150號B1','O',25),(82,'O15','三重','Sanchong',25.05571000,121.48422000,'241012新北市三重區捷運路36號B1','O',25),(83,'O16','先嗇宮','Xianse Temple',25.04632000,121.47165000,'241017新北市三重區重新路5段515號B1','O',25),(84,'O17','頭前庄','Touqianzhuang',25.03986200,121.46047900,'24251新北市新莊區思源路18號B1','O',25),(85,'O18','新莊','Xinzhuang',25.03608000,121.45218000,'242008新北市新莊區中正路138號B1','O',25),(86,'O19','輔大','Fu Jen University',25.03279000,121.43573500,'242062新北市新莊區中正路510之1號B1','O',25),(87,'O20','丹鳳','Danfeng',25.02907300,121.42242200,'242048新北市新莊區中正路624之1號B1','O',25),(88,'O21','迴龍','Huilong',25.02210700,121.41175700,'242052新北市新莊區中正路758號B1','O',0),(89,'O50','三重國小','Sanchong Elementary School',25.07027500,121.49701000,'241054新北市三重區三和路3段5號B1','O',25),(90,'O51','三和國中','Sanhe Junior High School',25.07646000,121.48679500,'241080新北市三重區三和路4段107號B1','O',25),(91,'O52','徐匯中學','St.lgnatius High School',25.08048500,121.47994500,'247019新北市蘆洲區中山一路3號B1','O',25),(92,'O53','三民高中','Sanmin Senior High School',25.08542500,121.47336500,'247010新北市蘆洲區三民路105號B1','O',25),(93,'O54','蘆洲','Luzhou',25.09152000,121.46471000,'247011新北市蘆洲區三民路386號B1','O',0),(94,'R02','象山','Xiangshan',25.03239500,121.57011600,'110022臺北市信義區信義路5段152號B1','R',0),(95,'R03','台北101/世貿','Taipei 101/World Trade Center',25.03286500,121.56366700,'110013臺北市信義區信義路5段20號B1','R',29),(96,'R04','信義安和','Xinyi Anhe',25.03301500,121.55232600,'106049臺北市大安區信義路4段212之1號B1','R',26),(97,'R05','大安','Daan',25.03331100,121.54237000,'106028臺北市大安區信義路3段180號B1','R',37),(98,'R06','大安森林公園','Daan Park',25.03322500,121.53615100,'106008臺北市大安區信義路3段100號B1','R',25),(99,'R07','東門','Dongmen',25.03389400,121.52876600,'106007臺北市大安區信義路2段166號B1','R',31),(100,'R08','中正紀念堂','Chiang Kai-Shek Memorial Hall',25.03276700,121.51827300,'100207臺北市中正區羅斯福路1段8之1號B1?','R',30),(101,'R09','台大醫院','NTU Hospital',25.04139900,121.51602000,'100006臺北市中正區公園路52號B1','R',26),(102,'R10','台北車站','Taipei Main Station',25.04631000,121.51741500,'100009臺北市中正區忠孝西路1段49號','R',35),(103,'R11','中山','Zhongshan',25.05262100,121.52036400,'103014臺北市大同區南京西路16號','R',28),(104,'R12','雙連','Shuanglian',25.05757500,121.52068500,'103018臺北市大同區民生西路47號','R',28),(105,'R13','民權西路','Minquan W. Rd.',25.06235000,121.51958500,'103045臺北市大同區民權西路72號','R',34),(106,'R14','圓山','Yuanshan',25.07140900,121.52007400,'103032臺北市大同區酒泉街9之1號','R',26),(107,'R15','劍潭','Jiantan',25.08420100,121.52495500,'111011臺北市士林區中山北路5段65號','R',26),(108,'R16','士林','Shilin',25.09349200,121.52623000,'111012臺北市士林區福德路1號','R',26),(109,'R17','芝山','Zhishan',25.10271800,121.52254600,'111031臺北市士林區福國路70號','R',26),(110,'R18','明德','Mingde',25.10981500,121.51878500,'112038臺北市北投區明德路95號','R',26),(111,'R19','石牌','Shipai',25.11445500,121.51557200,'112052臺北市北投區石牌路1段200號','R',26),(112,'R20','唭哩岸','Qilian',25.12085200,121.50623400,'112025臺北市北投區東華街2段301號','R',24),(113,'R21','奇岩','Qiyan',25.12547000,121.50114000,'112057臺北市北投區三合街2段489號','R',23),(114,'R22','北投','Beitou',25.13181900,121.49864800,'112006臺北市北投區光明路1號','R',0),(115,'R22A','新北投','Xinbeitou',25.13693100,121.50259500,'112028臺北市北投區大業路700號','R',0),(116,'R23','復興崗','Fuxinggang',25.13749700,121.48545600,'112054臺北市北投區中央北路3段53巷10號','R',25),(117,'R24','忠義','Zhongyi',25.13092300,121.47329800,'112017臺北市北投區中央北路4段301號','R',25),(118,'R25','關渡','Guandu',25.12551000,121.46700000,'112021臺北市北投區大度路3段296巷51號','R',25),(119,'R26','竹圍','Zhuwei',25.13690000,121.45955000,'251033新北市淡水區民權路50號','R',25),(120,'R27','紅樹林','Hongshulin',25.15399000,121.45880000,'251033新北市淡水區中正東路2段68號','R',25),(121,'R28','淡水','Tamsui',25.16774500,121.44580500,'251018新北市淡水區中正路1號','R',0),(122,'Y07','大坪林','Dapinglin',24.98272000,121.54134000,'23143新北市新店區北新路3段190號','Y',0),(123,'Y08','十四張','Shisizhang',24.98433300,121.52769800,'23141新北市新店區民權路282號','Y',23),(124,'Y09','秀朗橋','Xiulang Bridge',24.99054900,121.52505100,'23582新北市中和區景平路2號','Y',23),(125,'Y10','景平','Jingping',24.99196800,121.51655300,'23578新北市中和區景平路121號','Y',25),(126,'Y11','景安','Jingan',24.99392000,121.50511400,'23582新北市中和區景平路486號','Y',35),(127,'Y12','中和','Zhonghe',25.00198100,121.49605200,'23558新北市中和區中山路二段271號','Y',25),(128,'Y13','橋和','Qiaohe',25.00441300,121.49046100,'23557新北市中和區板南路430號','Y',25),(129,'Y14','中原','Zhongyuan',25.00841000,121.48415900,'23556新北市中和區板南路510號','Y',25),(130,'Y15','板新','Banxin',25.01449100,121.47221200,'22066新北市板橋區板新路109號','Y',25),(131,'Y16','板橋','Banqiao',25.01515600,121.46482500,'22041新北市板橋區新站路66號','Y',40),(132,'Y17','新埔民生','Xinpu Minsheng',25.02612500,121.46683900,'22047新北市板橋區民生路3段70號','Y',25),(133,'Y18','頭前庄','Touqianzhuang',25.03986200,121.46047900,'24251新北市新莊區思源路18號B1','Y',35),(134,'Y19','幸福','Xingfu',25.05028200,121.46021600,'24250新北市新莊區思源路292號','Y',23),(135,'Y20','新北產業園區','New Taipei Industrial Park',25.06154800,121.45992600,'24886新北市新莊區五工路35號','Y',0);
/*!40000 ALTER TABLE `metro_station` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `metro_travel_time`
--

DROP TABLE IF EXISTS `metro_travel_time`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `metro_travel_time` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `from_line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `to_line_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `from_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `to_station_id` varchar(45) COLLATE utf8_bin NOT NULL,
  `run_time` bigint(20) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `metro_travel_time_ibfk_1` (`from_line_id`),
  KEY `metro_travel_time_ibfk_2` (`to_line_id`),
  KEY `metro_travel_time_ibfk_3` (`from_station_id`),
  KEY `metro_travel_time_ibfk_4` (`to_station_id`),
  CONSTRAINT `metro_travel_time_ibfk_1` FOREIGN KEY (`from_line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_travel_time_ibfk_2` FOREIGN KEY (`to_line_id`) REFERENCES `metro_line` (`line_id`),
  CONSTRAINT `metro_travel_time_ibfk_3` FOREIGN KEY (`from_station_id`) REFERENCES `metro_station` (`station_id`),
  CONSTRAINT `metro_travel_time_ibfk_4` FOREIGN KEY (`to_station_id`) REFERENCES `metro_station` (`station_id`)
) ENGINE=InnoDB AUTO_INCREMENT=451 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `metro_travel_time`
--

LOCK TABLES `metro_travel_time` WRITE;
/*!40000 ALTER TABLE `metro_travel_time` DISABLE KEYS */;
INSERT INTO `metro_travel_time` VALUES (1,'BL','BL','BL22','BL21',109),(2,'BL','BL','BL21','BL22',109),(3,'BL','BL','BL14','BL13',81),(4,'BL','BL','BL13','BL14',81),(5,'BL','BL','BL15','BL14',90),(6,'BL','BL','BL14','BL15',90),(7,'BL','BL','BL09','BL08',77),(8,'BL','BL','BL08','BL09',77),(9,'BL','BL','BL06','BL05',102),(10,'BL','BL','BL05','BL06',102),(11,'BL','BL','BL07','BL06',67),(12,'BL','BL','BL06','BL07',67),(13,'BL','BL','BL13','BL12',66),(14,'BL','BL','BL12','BL13',66),(15,'BL','BL','BL20','BL19',76),(16,'BL','BL','BL19','BL20',76),(17,'BL','BL','BL17','BL16',71),(18,'BL','BL','BL16','BL17',71),(19,'BL','BL','BL10','BL09',192),(20,'BL','BL','BL09','BL10',192),(21,'BL','BL','BL03','BL02',95),(22,'BL','BL','BL02','BL03',95),(23,'BL','BL','BL12','BL11',120),(24,'BL','BL','BL11','BL12',120),(25,'BL','BL','BL21','BL20',107),(26,'BL','BL','BL20','BL21',107),(27,'BL','BL','BL08','BL07',107),(28,'BL','BL','BL07','BL08',107),(29,'BL','BL','BL16','BL15',65),(30,'BL','BL','BL15','BL16',65),(31,'BL','BL','BL23','BL22',112),(32,'BL','BL','BL22','BL23',112),(33,'BL','BL','BL04','BL03',106),(34,'BL','BL','BL03','BL04',106),(35,'BL','BL','BL18','BL17',77),(36,'BL','BL','BL17','BL18',77),(37,'BL','BL','BL11','BL10',110),(38,'BL','BL','BL10','BL11',110),(39,'BL','BL','BL02','BL01',180),(40,'BL','BL','BL01','BL02',180),(41,'BL','BL','BL19','BL18',87),(42,'BL','BL','BL18','BL19',87),(43,'BL','BL','BL05','BL04',142),(44,'BL','BL','BL04','BL05',142),(45,'BL','BL','BL23','BL22',112),(46,'BL','BL','BL22','BL23',112),(47,'BL','BL','BL20','BL19',76),(48,'BL','BL','BL19','BL20',76),(49,'BL','BL','BL18','BL17',77),(50,'BL','BL','BL17','BL18',77),(51,'BL','BL','BL13','BL12',66),(52,'BL','BL','BL12','BL13',66),(53,'BL','BL','BL17','BL16',71),(54,'BL','BL','BL16','BL17',71),(55,'BL','BL','BL16','BL15',65),(56,'BL','BL','BL15','BL16',65),(57,'BL','BL','BL21','BL20',107),(58,'BL','BL','BL20','BL21',107),(59,'BL','BL','BL09','BL08',77),(60,'BL','BL','BL08','BL09',77),(61,'BL','BL','BL12','BL11',120),(62,'BL','BL','BL11','BL12',120),(63,'BL','BL','BL14','BL13',81),(64,'BL','BL','BL13','BL14',81),(65,'BL','BL','BL06','BL05',102),(66,'BL','BL','BL05','BL06',102),(67,'BL','BL','BL22','BL21',109),(68,'BL','BL','BL21','BL22',109),(69,'BL','BL','BL15','BL14',90),(70,'BL','BL','BL14','BL15',90),(71,'BL','BL','BL19','BL18',87),(72,'BL','BL','BL18','BL19',87),(73,'BL','BL','BL07','BL06',67),(74,'BL','BL','BL06','BL07',67),(75,'BL','BL','BL11','BL10',110),(76,'BL','BL','BL10','BL11',110),(77,'BL','BL','BL08','BL07',107),(78,'BL','BL','BL07','BL08',107),(79,'BL','BL','BL10','BL09',192),(80,'BL','BL','BL09','BL10',192),(81,'BR','BR','BR05','BR04',106),(82,'BR','BR','BR04','BR05',106),(83,'BR','BR','BR16','BR15',110),(84,'BR','BR','BR15','BR16',110),(85,'BR','BR','BR21','BR20',121),(86,'BR','BR','BR20','BR21',121),(87,'BR','BR','BR03','BR02',47),(88,'BR','BR','BR02','BR03',47),(89,'BR','BR','BR07','BR06',72),(90,'BR','BR','BR06','BR07',72),(91,'BR','BR','BR06','BR05',124),(92,'BR','BR','BR05','BR06',124),(93,'BR','BR','BR12','BR11',66),(94,'BR','BR','BR11','BR12',66),(95,'BR','BR','BR18','BR17',72),(96,'BR','BR','BR17','BR18',72),(97,'BR','BR','BR09','BR08',69),(98,'BR','BR','BR08','BR09',69),(99,'BR','BR','BR23','BR22',85),(100,'BR','BR','BR22','BR23',85),(101,'BR','BR','BR02','BR01',67),(102,'BR','BR','BR01','BR02',67),(103,'BR','BR','BR24','BR23',78),(104,'BR','BR','BR23','BR24',78),(105,'BR','BR','BR14','BR13',172),(106,'BR','BR','BR13','BR14',172),(107,'BR','BR','BR22','BR21',78),(108,'BR','BR','BR21','BR22',78),(109,'BR','BR','BR20','BR19',71),(110,'BR','BR','BR19','BR20',71),(111,'BR','BR','BR15','BR14',103),(112,'BR','BR','BR14','BR15',103),(113,'BR','BR','BR17','BR16',65),(114,'BR','BR','BR16','BR17',65),(115,'BR','BR','BR13','BR12',142),(116,'BR','BR','BR12','BR13',142),(117,'BR','BR','BR11','BR10',86),(118,'BR','BR','BR10','BR11',86),(119,'BR','BR','BR08','BR07',122),(120,'BR','BR','BR07','BR08',122),(121,'BR','BR','BR19','BR18',78),(122,'BR','BR','BR18','BR19',78),(123,'BR','BR','BR04','BR03',99),(124,'BR','BR','BR03','BR04',99),(125,'BR','BR','BR10','BR09',67),(126,'BR','BR','BR09','BR10',67),(127,'G','G','G19','G18',138),(128,'G','G','G18','G19',138),(129,'G','G','G18','G17',102),(130,'G','G','G17','G18',102),(131,'G','G','G14','G13',116),(132,'G','G','G13','G14',116),(133,'G','G','G11','G10',76),(134,'G','G','G10','G11',76),(135,'G','G','G07','G06',122),(136,'G','G','G06','G07',122),(137,'G','G','G15','G14',106),(138,'G','G','G14','G15',106),(139,'G','G','G05','G04',92),(140,'G','G','G04','G05',92),(141,'G','G','G16','G15',92),(142,'G','G','G15','G16',92),(143,'G','G','G12','G11',83),(144,'G','G','G11','G12',83),(145,'G','G','G17','G16',84),(146,'G','G','G16','G17',84),(147,'G','G','G03','G02',81),(148,'G','G','G02','G03',81),(149,'G','G','G13','G12',86),(150,'G','G','G12','G13',86),(151,'G','G','G08','G07',79),(152,'G','G','G07','G08',79),(153,'G','G','G06','G05',89),(154,'G','G','G05','G06',89),(155,'G','G','G10','G09',87),(156,'G','G','G09','G10',87),(157,'G','G','G04','G03',78),(158,'G','G','G03','G04',78),(159,'G','G','G09','G08',85),(160,'G','G','G08','G09',85),(161,'G','G','G02','G01',111),(162,'G','G','G01','G02',111),(163,'G','G','G13','G12',86),(164,'G','G','G12','G13',86),(165,'G','G','G19','G18',138),(166,'G','G','G18','G19',138),(167,'G','G','G11','G10',76),(168,'G','G','G10','G11',76),(169,'G','G','G12','G11',83),(170,'G','G','G11','G12',83),(171,'G','G','G09','G08',85),(172,'G','G','G08','G09',85),(173,'G','G','G17','G16',84),(174,'G','G','G16','G17',84),(175,'G','G','G10','G09',87),(176,'G','G','G09','G10',87),(177,'G','G','G18','G17',102),(178,'G','G','G17','G18',102),(179,'G','G','G14','G13',116),(180,'G','G','G13','G14',116),(181,'G','G','G15','G14',106),(182,'G','G','G14','G15',106),(183,'G','G','G16','G15',92),(184,'G','G','G15','G16',92),(185,'G','G','G03','G03A',203),(186,'G','G','G03A','G03',203),(187,'O','O','O20','O19',113),(188,'O','O','O19','O20',113),(189,'O','O','O15','O14',84),(190,'O','O','O14','O15',84),(191,'O','O','O04','O03',103),(192,'O','O','O03','O04',103),(193,'O','O','O08','O07',102),(194,'O','O','O07','O08',102),(195,'O','O','O10','O09',96),(196,'O','O','O09','O10',96),(197,'O','O','O02','O01',97),(198,'O','O','O01','O02',97),(199,'O','O','O11','O10',72),(200,'O','O','O10','O11',72),(201,'O','O','O06','O05',208),(202,'O','O','O05','O06',208),(203,'O','O','O19','O18',137),(204,'O','O','O18','O19',137),(205,'O','O','O05','O04',187),(206,'O','O','O04','O05',187),(207,'O','O','O17','O16',108),(208,'O','O','O16','O17',108),(209,'O','O','O12','O11',72),(210,'O','O','O11','O12',72),(211,'O','O','O14','O13',97),(212,'O','O','O13','O14',97),(213,'O','O','O13','O12',127),(214,'O','O','O12','O13',127),(215,'O','O','O16','O15',142),(216,'O','O','O15','O16',142),(217,'O','O','O07','O06',136),(218,'O','O','O06','O07',136),(219,'O','O','O21','O20',168),(220,'O','O','O20','O21',168),(221,'O','O','O09','O08',78),(222,'O','O','O08','O09',78),(223,'O','O','O03','O02',90),(224,'O','O','O02','O03',90),(225,'O','O','O18','O17',94),(226,'O','O','O17','O18',94),(227,'O','O','O10','O09',96),(228,'O','O','O09','O10',96),(229,'O','O','O53','O52',92),(230,'O','O','O52','O53',92),(231,'O','O','O06','O05',208),(232,'O','O','O05','O06',208),(233,'O','O','O07','O06',136),(234,'O','O','O06','O07',136),(235,'O','O','O05','O04',187),(236,'O','O','O04','O05',187),(237,'O','O','O11','O10',72),(238,'O','O','O10','O11',72),(239,'O','O','O03','O02',90),(240,'O','O','O02','O03',90),(241,'O','O','O12','O11',72),(242,'O','O','O11','O12',72),(243,'O','O','O09','O08',78),(244,'O','O','O08','O09',78),(245,'O','O','O51','O50',107),(246,'O','O','O50','O51',107),(247,'O','O','O50','O12',151),(248,'O','O','O12','O50',151),(249,'O','O','O02','O01',97),(250,'O','O','O01','O02',97),(251,'O','O','O08','O07',102),(252,'O','O','O07','O08',102),(253,'O','O','O54','O53',111),(254,'O','O','O53','O54',111),(255,'O','O','O52','O51',82),(256,'O','O','O51','O52',82),(257,'O','O','O04','O03',103),(258,'O','O','O03','O04',103),(259,'R','R','R08','R07',175),(260,'R','R','R07','R08',175),(261,'R','R','R03','R02',93),(262,'R','R','R02','R03',93),(263,'R','R','R19','R18',63),(264,'R','R','R18','R19',63),(265,'R','R','R13','R12',60),(266,'R','R','R12','R13',60),(267,'R','R','R09','R08',95),(268,'R','R','R08','R09',95),(269,'R','R','R12','R11',62),(270,'R','R','R11','R12',62),(271,'R','R','R07','R06',75),(272,'R','R','R06','R07',75),(273,'R','R','R27','R26',138),(274,'R','R','R26','R27',138),(275,'R','R','R23','R22',135),(276,'R','R','R22','R23',135),(277,'R','R','R11','R10',68),(278,'R','R','R10','R11',68),(279,'R','R','R16','R15',95),(280,'R','R','R15','R16',95),(281,'R','R','R10','R09',67),(282,'R','R','R09','R10',67),(283,'R','R','R14','R13',88),(284,'R','R','R13','R14',88),(285,'R','R','R06','R05',74),(286,'R','R','R05','R06',74),(287,'R','R','R28','R27',175),(288,'R','R','R27','R28',175),(289,'R','R','R18','R17',79),(290,'R','R','R17','R18',79),(291,'R','R','R17','R16',94),(292,'R','R','R16','R17',94),(293,'R','R','R25','R24',80),(294,'R','R','R24','R25',80),(295,'R','R','R22','R21',91),(296,'R','R','R21','R22',91),(297,'R','R','R04','R03',94),(298,'R','R','R03','R04',94),(299,'R','R','R15','R14',112),(300,'R','R','R14','R15',112),(301,'R','R','R20','R19',103),(302,'R','R','R19','R20',103),(303,'R','R','R21','R20',75),(304,'R','R','R20','R21',75),(305,'R','R','R05','R04',90),(306,'R','R','R04','R05',90),(307,'R','R','R24','R23',112),(308,'R','R','R23','R24',112),(309,'R','R','R26','R25',148),(310,'R','R','R25','R26',148),(311,'R','R','R12','R11',62),(312,'R','R','R11','R12',62),(313,'R','R','R13','R12',60),(314,'R','R','R12','R13',60),(315,'R','R','R20','R19',103),(316,'R','R','R19','R20',103),(317,'R','R','R06','R05',74),(318,'R','R','R05','R06',74),(319,'R','R','R09','R08',95),(320,'R','R','R08','R09',95),(321,'R','R','R15','R14',112),(322,'R','R','R14','R15',112),(323,'R','R','R19','R18',63),(324,'R','R','R18','R19',63),(325,'R','R','R18','R17',79),(326,'R','R','R17','R18',79),(327,'R','R','R07','R06',75),(328,'R','R','R06','R07',75),(329,'R','R','R08','R07',175),(330,'R','R','R07','R08',175),(331,'R','R','R17','R16',94),(332,'R','R','R16','R17',94),(333,'R','R','R21','R20',75),(334,'R','R','R20','R21',75),(335,'R','R','R16','R15',95),(336,'R','R','R15','R16',95),(337,'R','R','R14','R13',88),(338,'R','R','R13','R14',88),(339,'R','R','R10','R09',67),(340,'R','R','R09','R10',67),(341,'R','R','R22','R21',91),(342,'R','R','R21','R22',91),(343,'R','R','R11','R10',68),(344,'R','R','R10','R11',68),(345,'R','R','R22','R22A',157),(346,'R','R','R22A','R22',157),(347,'Y','Y','Y17','Y16',191),(348,'Y','Y','Y16','Y17',191),(349,'Y','Y','Y16','Y15',153),(350,'Y','Y','Y15','Y16',153),(351,'Y','Y','Y15','Y14',111),(352,'Y','Y','Y14','Y15',111),(353,'Y','Y','Y19','Y18',95),(354,'Y','Y','Y18','Y19',95),(355,'Y','Y','Y09','Y08',111),(356,'Y','Y','Y08','Y09',111),(357,'Y','Y','Y11','Y10',84),(358,'Y','Y','Y10','Y11',84),(359,'Y','Y','Y08','Y07',145),(360,'Y','Y','Y07','Y08',145),(361,'Y','Y','Y13','Y12',104),(362,'Y','Y','Y12','Y13',104),(363,'Y','Y','Y10','Y09',79),(364,'Y','Y','Y09','Y10',79),(365,'Y','Y','Y20','Y19',135),(366,'Y','Y','Y19','Y20',135),(367,'Y','Y','Y14','Y13',72),(368,'Y','Y','Y13','Y14',72),(369,'Y','Y','Y18','Y17',143),(370,'Y','Y','Y17','Y18',143),(371,'Y','Y','Y12','Y11',194),(372,'Y','Y','Y11','Y12',194),(373,'BL','BR','BL23','BR24',300),(374,'BR','BL','BR24','BL23',300),(375,'R','O','R07','O06',120),(376,'O','R','O06','R07',120),(377,'R','G','R11','G14',180),(378,'G','R','G14','R11',180),(379,'G','BR','G16','BR11',300),(380,'BR','G','BR11','G16',300),(381,'G','O','G15','O08',120),(382,'O','G','O08','G15',120),(383,'O','G','O05','G09',120),(384,'G','O','G09','O05',120),(385,'R','BR','R05','BR09',300),(386,'BR','R','BR09','R05',300),(387,'G','BL','G12','BL11',120),(388,'BL','G','BL11','G12',120),(389,'BR','BL','BR10','BL15',300),(390,'BL','BR','BL15','BR10',300),(391,'BR','BL','BR24','BL23',300),(392,'BL','BR','BL23','BR24',300),(393,'G','O','G09','O05',120),(394,'O','G','O05','G09',120),(395,'BL','O','BL14','O07',120),(396,'O','BL','O07','BL14',120),(397,'R','O','R13','O11',180),(398,'O','R','O11','R13',180),(399,'BL','G','BL11','G12',120),(400,'G','BL','G12','BL11',120),(401,'O','O','O12','O12',60),(402,'O','O','O12','O12',60),(403,'R','R','R22','R22',180),(404,'R','R','R22','R22',180),(405,'BR','R','BR09','R05',300),(406,'R','BR','R05','BR09',300),(407,'O','R','O11','R13',180),(408,'R','O','R13','O11',180),(409,'O','BL','O07','BL14',120),(410,'BL','O','BL14','O07',120),(411,'G','G','G03','G03',180),(412,'G','G','G03','G03',180),(413,'BL','R','BL12','R10',240),(414,'R','BL','R10','BL12',240),(415,'O','Y','O02','Y11',360),(416,'Y','O','Y11','O02',360),(417,'Y','BL','Y16','BL07',660),(418,'BL','Y','BL07','Y16',660),(419,'BL','BR','BL15','BR10',300),(420,'BR','BL','BR10','BL15',300),(421,'G','R','G10','R08',120),(422,'R','G','R08','G10',120),(423,'R','G','R08','G10',120),(424,'G','R','G10','R08',120),(425,'R','BL','R10','BL12',240),(426,'BL','R','BL12','R10',240),(427,'O','Y','O17','Y18',360),(428,'Y','O','Y18','O17',360),(429,'BR','G','BR11','G16',300),(430,'G','BR','G16','BR11',300),(431,'Y','G','Y07','G04',180),(432,'G','Y','G04','Y07',180),(433,'G','R','G14','R11',180),(434,'R','G','R11','G14',180),(435,'BL','Y','BL08','Y17',540),(436,'Y','BL','Y17','BL08',540),(437,'BL','Y','BL07','Y16',660),(438,'Y','BL','Y16','BL07',660),(439,'O','G','O08','G15',120),(440,'G','O','G15','O08',120),(441,'O','R','O06','R07',120),(442,'R','O','R07','O06',120),(443,'G','Y','G04','Y07',180),(444,'Y','G','Y07','G04',180),(445,'Y','BL','Y17','BL08',540),(446,'BL','Y','BL08','Y17',540),(447,'Y','O','Y18','O17',360),(448,'O','Y','O17','Y18',360),(449,'Y','O','Y11','O02',360),(450,'O','Y','O02','Y11',360);
/*!40000 ALTER TABLE `metro_travel_time` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-11-29 14:12:11
